[
  {
    "status": true,
    "value": "Criterion_1",
    "label": "Complexity",
    "Definition": "Complexity assesses the difficulty of a redesign solution, distinguishing between minor fixes and the introduction of new features.",
    "Rating_1": "Extremely High: Major new feature implementations that transform the user experience or product functionality.",
    "Rating_2": "High: Significant new features demanding considerable resources and integration effort.",
    "Rating_3": "Moderate: Introduces small new features that require moderate planning and resources.",
    "Rating_4": "Low: Simple fixes, easy to implement with little impact on existing structures.",
    "Rating_5": "Extremely Low: Trivial adjustments requiring minimal effort."
  },
  {
    "status": true,
    "value": "Criterion_2",
    "label": "Time spent",
    "Definition": "Time spent quantifies the implementation duration of a redesign solution.",
    "Rating_1": "Very Lengthy: Implementation is very slow, extending over a long period.",
    "Rating_2": "Lengthy: Implementation is slow, requiring substantial time.",
    "Rating_3": "Moderate: Implementation takes a reasonable amount of time.",
    "Rating_4": "Quick: Implementation is fast with minimal delays.",
    "Rating_5": "Very Quick: Implementation is immediate or nearly immediate."
  },
  {
    "status": false,
    "value": "Criterion_3",
    "label": "Money spent",
    "Definition": "Money spent evaluates the financial resources required to implement a redesign solution.",
    "Rating_1": "Very High: Very large financial expenditure required.",
    "Rating_2": "High: Significant financial investment demanded.",
    "Rating_3": "Moderate: Moderate financial resources necessary.",
    "Rating_4": "Low: Small financial investment required.",
    "Rating_5": "Very Low: Minimal financial investment needed."
  },
  {
    "status": false,
    "value": "Criterion_4",
    "label": "Consistency",
    "Definition": "Consistency measures how well a redesign solution utilizes existing design elements within the product.",
    "Rating_1": "Very Low: No use of existing design elements.",
    "Rating_2": "Low: Minimal use of existing design elements.",
    "Rating_3": "Moderate: Some use of existing design elements.",
    "Rating_4": "High: Strong use of existing design elements.",
    "Rating_5": "Very High: Full integration with existing design elements."
  },
  {
    "status": false,
    "value": "Criterion_5",
    "label": "Rationality",
    "Definition": "Rationality assesses whether a redesign solution logically addresses and resolves the identified usability problems.",
    "Rating_1": "Very Low: Does not address usability problems.",
    "Rating_2": "Low: Poorly addresses minor usability problems.",
    "Rating_3": "Moderate: Adequately solves some usability problems.",
    "Rating_4": "High: Effectively resolves most usability problems.",
    "Rating_5": "Very High: Excellently addresses and resolves all relevant usability problems."
  },
  {
    "status": true,
    "value": "Criterion_6",
    "label": "Feasibility",
    "Definition": "Feasibility evaluates the practicality and likelihood of successfully implementing a redesign solution.",
    "Rating_1": "Very Low: Nearly impossible to implement.",
    "Rating_2": "Low: Difficult to implement with significant obstacles.",
    "Rating_3": "Moderate: Reasonably achievable with manageable challenges.",
    "Rating_4": "High: Easily implementable with minor hurdles.",
    "Rating_5": "Very High: Straightforward to implement with no significant barriers."
  },
  {
    "status": true,
    "value": "Criterion_7",
    "label": "Impact",
    "Definition": "Impact measures the extent to which a redesign solution enhances the user experience.",
    "Rating_1": "Very Low: Negligible improvement to user experience.",
    "Rating_2": "Low: Minor enhancement to user experience.",
    "Rating_3": "Moderate: Noticeable improvement to user experience.",
    "Rating_4": "High: Significant enhancement to user experience.",
    "Rating_5": "Very High: Transformative improvement to user experience."
  },
  {
    "status": true,
    "value": "Criterion_8",
    "label": "Inclusivity",
    "Definition": "Inclusivity assesses the extent to which a redesign solution accommodates the specific needs and capabilities of all user groups, including those with special considerations like the elderly.",
    "Rating_1": "Very Low: Does not consider the needs of special user groups at all.",
    "Rating_2": "Low: Minimally considers the needs of special user groups.",
    "Rating_3": "Moderate: Reasonably accommodates the needs of special user groups.",
    "Rating_4": "High: Strongly considers and effectively addresses the needs of special user groups.",
    "Rating_5": "Very High:: Excellently incorporates comprehensive features and designs that fully support the needs of special user groups, enhancing accessibility and usability for all."
  },
  {
    "status": false,
    "value": "Criterion_9",
    "label": "Limitations",
    "Definition": "Limitations identify the shortcomings and constraints of a redesign solution that may hinder its effectiveness or applicability.",
    "Rating_1": "Very High: Severe limitations that greatly restrict effectiveness.",
    "Rating_2": "High: Significant shortcomings that limit functionality.",
    "Rating_3": "Moderate: Some notable limitations, but still functional.",
    "Rating_4": "Low: Minor limitations, mostly effective.",
    "Rating_5": "Very Low: Negligible limitations, effectively meets all intended goals."
  },
  {
    "status": false,
    "value": "Criterion_10",
    "label": "Aesthetic",
    "Definition": "Aesthetic evaluates the visual appeal and design harmony of a redesign solution.",
    "Rating_1": "Very Low: Visually unappealing and incoherent design.",
    "Rating_2": "Low: Limited visual appeal with some design inconsistencies.",
    "Rating_3": "Moderate: Adequately pleasing and generally consistent design.",
    "Rating_4": "High: Visually attractive with cohesive design elements.",
    "Rating_5": "Very High: Exceptionally appealing and perfectly harmonious design."
  }
]